#                       5
7+7-3*2/(2+2);3*9^0.5
2%/%2/10
20/2%/%2
#целочисленное деление выполняется первым
#то есть имеет приоритет перед обычным
10%/%2%%3
10%%8%/%2
#целочисленное деление и остаток от деления имеют
#равные приоритеты
10%%7%/%3
#                        6
1/0
0/0
v1 <- c(NULL, NULL, NULL)
str(v1)
v <-  c( 1, NA, NULL)
v[5]
#                       7
{
  a <- as.integer(readline('Введите число: '))
  b <- as.integer(readline('Введите число: '))
  print(paste("a=",a,"b=",b,"a^b=",a^b))
  print(paste("a=",a,"b=",b,"b^a=",b^a))
  print(paste("a=",a,"b=",b,"b/a=",a/b))
  print(paste("a=",a,"b=",b,"b/0=",b/0))
}
